[
  {
    "content": "# About Me\r\n\r\nMy name is Aneesh and I'm a writer, programmer and a soon-to-be physics major. I like thinking and writing about Science, the Universe, existentialism, and death. Most of my writing also revolves around these things.\r\n\r\nI love watching movies and reading books. And I like people who like these things as well. So if you do, reach out to me. I'm currently doing a run of Quentin Tarantino's movies, so that I can say that I've watched all of his oeuvre before his next and final movie. \r\n\r\nI'm also working on a sci-fi novel right now. It's my first time writing a long-form piece of content, so it's a bit back-breaking but I expect to be done by it by 2024 (That is if I don't procrastinate or don't abandon it altogther).\r\n\r\nI hope to release a new post on this blog once or twice a week. The blog itself will be improved over-time since it's me writing the code for it. You can view the source code on my GitHub.\r\n\r\nLastly, if you want to reach out to me you can do so on my email aneeshbhatr@gmail.com\r\n\r\nThanks a lot for checking my tiny corner of the internet out. I hope you have a brilliant day and a brilliant life.\r\n\r\n\r\n\r\n\r\n\r\n"
  },
  {
    "content": "# Hi, I'm Aneesh\r\n\r\nThis website serves as a platform for me to explore my interests, through my writing and whatever else I decide to do on this. Check out the Blog page to read my essays and stories. To know more about me, check out the About page. \r\n\r\nMy non-fiction writing usually centers around subjects of philosophy and Science. I would call myself an optimistic nihilist ([See Kurzgesagt's video on it.](https://youtu.be/MBRqu0YOH14)). I believe that the universe is devoid of any inherent meaning and that's OK! We can have a laugh about that fact and have a jolly good time, for the short while we're here on earth.\r\n\r\nMy fiction writing is mostly science fiction, since I love that genre and my best work has been in the form of sci-fi stories. I prefer sci-fi where the world is somewhat a utopia, like the world of Peter F. Hamilton's Commonwealth Saga.\r\n\r\nIf you want to look at what I'm reading of late, you can check out the reading list down below (Click on the book icon.) \r\n\r\nWell, there's nothing more to say really. \r\n\r\nCheers!\r\n"
  }
]