[
  {
    "id": 1684001400,
    "title": "30DWC 01\r",
    "author": "Aneesh R. Bhat\r",
    "date": "May 13, 2023",
    "time": "23:40",
    "content": "## Chaos to Order, The function of fiction and other ramblings to finish my daily writing quota\r\n\r\nI was journaling this morning and came up with something that I instantly knew was going into my notes.\r\n\r\n> I have only my experience of reality to account for. A writer’s job is to bridge the gap between the experiencer and the experienced. It brings the reader close to a whole domain of reality hitherto restricted to them, due to the fact that your experience of reality resides solely within your mind.\r\n\r\nIt's often said that reality is stranger than fiction. That's true. Reality is not bound by the limitations of human imagination, out of which fiction is born. There might as well be some kind of celestial entity, some kind of alien race, some piece of technology in some distant corner of the universe, that the most ingenuitive sci-fi writers can't come up with. Because they, even in the mastery of their craft, are bound by the same limits that you and I are. The limit of finite experience. The farthest things we can ever know about are within the observable universe, and the deepest we can go into the stuff that makes up matter is at the level of the Quarks and Leptons. Anything  we can know, and as a result imagine about (even in ways that can never be real) are bound by these limitations. But reality is not. Sure, the laws of physics bind reality, but do we know all the laws that govern the universe? No. So there must be something in reality that is yet to seem stranger to us than fiction. \r\nBut fiction plays an important function. It brings us closer to reality, in the sense that it allows us to fathom what possibilities reality might allow to become real. Many inventions today were thought of by veterans of sci-fi years before they were even deemed a possibility. Hoverboards, tablets, digital billboards, and what seems like the big daddy of all technology today,  Artificial Intelligence.\r\n\r\nWe have to be able to imagine something for us to even begin working to make it real. Fiction does that for us. That's why I love sci-fi. It's us coming to terms with our future reality so that when it does finally arrive, we might not be as weirded out by it, or frightened of it as we might be otherwise (Because as you know, humans tend to fear what they don't understand). What happens in the hearts of black holes? What happens to us when we sleep. What even is consciousness? These things might have weird answers, but because we would have already dwelled into their possible weirdness through fiction, it will be a tad bit easier for us to digest them.\r\n\r\n\r\nI have another question. Just as the painter has her canvas and the sculptor has his block of stone, what is that for the writer? What is the writer's canvas? You might say it's the blank page, or the blank document. But the writer’s canvas is really the first draft.\r\n\r\nIt’s said that the constraints are the canvas. But the blank page is a domain of infinite possibility. Anything can happen within that blank sheet of paper. You might say that the writer is limited by how much she can write on the page. But  unlike the dimensions of the canvas or a block of stone, the length of the page  isn't really a limitation for the writer. A written work can span tens of thousands of pages or multiple volumes. The vocabulary of a language is also not a limitation, because writers can create their own words, just like how Douglas Adams created words like flollop and vollue to describe the activities of talking mattresses. Language itself isn't a limitation, because like J.R.R Tolkien, writers can create their own languages too. And readers will gobble that shit up if the quality of writing is good enough and even go as far as learning the fictional language.\r\n\r\nThere are only two real limitations posed to a writer. One, the number of characters/alphabets in any particular language she's writing in, along with the numerals, accented characters, or any other quirks of that system. These are finite, but when they are strung together to form words and subsequently sentences, paragraphs and entire works, the possibilities are endless. Sure, maybe certain letters can only work with certain other letters to form words and there are certain semantic and syntactic rules to a language, but the possibilities are still not far from endless. But a writer can't make up new characters and associated sounds unless everyone understands them and agrees to use them.  \r\n\r\nThe second limitation is the medium of the written word itself. There's a finite number of ways you can describe a person shooting another person in written form. That's the limitation that this medium provides a writer with. But the definition of who a writer is blurry today. A screenwriter is as much a writer as a writer for a video game who is as much a writer as a mangaka. They all use the features and limitations of their chosen medium to tell their story. But the medium nonetheless, has limitations. \r\n\r\nBut despite these, when the writer sits in front of the blank page or document, there's still a near-infinite amount of things that can end up being written on that page. And we know that infinite anything is bad. If you have an infinite amount of money, for example,  you'll crash the fucking economy, of course. But the personal value you attach to anything money could buy goes down drastically for you. Infinity is a quick path to nihilism.\r\n\r\nWhat the writer literally does is bring order from the seeming chaos of the blank page and creates something tangible, rule-bound and meaningful. Then the real process of writing begins. Then you have something to work with. The rules and the boundaries of whatever it is that is written are defined. They can be stretched, restricted further, or even broken. But at least they're not non-existent. \r\n\r\nThe first draft is akin to a slab of stone. The writer chisels away the excess, defines what is undefined, and in some cases even adds more meat where it’s required. She tames infinity and then makes it look pretty. In doing that, the writer moves from chaos to order, both in her mind and on the page and brings us, as a civilization, closer to reality. \r\n\r\n",
    "thumbnail": "/images/chaos.jpg\r"
  },
  {
    "id": 1676572200,
    "title": "A Case For Being Godless\r",
    "author": "Aneesh R. Bhat\r",
    "date": "February 17, 2023",
    "time": "00:00",
    "content": "God; The man up above; The omnipresent, omniscient, omnipotent entity that has been a part of human culture possibly since it's beginning. God is perhaps the most important thing in some people’s lives, so much so that they base major life decisions off of the word of God and sometimes dedicate their whole life in service of god. I’m sure those of you reading this believe or in some point in time used to believe in God. You can deduce from the title that I don’t. I don’t know if I ever have. \r\n\r\nI’ve always been pretty ambivalent about God’s existence. Growing up, I don’t recall a period in my life when I actively believed in a higher power. I saw no rationale in performing religious duties, so I did them out of compulsion, half-heartedly. I was never too keen on visiting temples and such because I saw them as a drag, as opposed to me sitting comfortably at my home.\r\n\r\nNow, I have realized I have no utility for God and Religion in my life. The question of God’s existence doesn’t bear any effect on my life. I can go so far as to say, God can reveal themselves tomorrow and I still won’t find myself worshipping them. I live as if God doesn’t exist.\r\n\r\nHere are the reasons why.\r\n\r\n## God is a terrible morality check\r\n\r\nMorality. That thing religions try and teach us by packaging them as words of God. We’re taught as kids a specific set of actions that are good and bad. Which actions will get you in the good graces of God and which actions will incur his wrath. For a kid - who doesn’t have an innate sense of morality, i.e., who can’t tell right from wrong - This is a maybe a good strategy to keep them in line. You tell kids, God will punish you if you lie, or if you steal or if you commit any other immoral action. Kids being kids are afraid of punishment, and especially punishment from a guy they have never seen, so they comply. But as adults or people who have, to some extent, developed an innate sense of what is right and what is wrong, is this how we should still be expected to stay in line?\r\n\r\nThe binary of good and bad they taught you as a kid is a myth. The world does not work on binaries. It’s filled with nuance. Granted, some things including rape and murder are definitively bad things and people who do them are scums of the earth. But there’s also a lot of grey we’re not taught to see. One example of this is a man stealing food to feed his starving children. According to our childhood binary morality, we might see the man as a ‘bad’ person for stealing or a ‘good’ person for doing whatever it takes for his children. But a grown up would think twice before pronouncing such moral judgements. \r\n\r\nI am not arguing for subjective morality: The idea that morals are human-made and there is no absolute right or absolute wrong. I do agree that there is a universal moral code, and many religions do share some essence of it. But we don’t need God to imbibe these morals within us.\r\n\r\nYou’re taught that after you die, you’ll be held accountable for your actions on Earth. Hence the more ‘good’ you do, the better your afterlife will be. Conversely, the more ‘bad’ you do, the worse your afterlife will be. Think heaven, paradise, hell and purgatory. Think eternal damnation and the pearly gates. Think Angels and Demons.\r\n\r\nBut is that not a terrible motivation to do ‘good’? Is being kind, generous, honest, charitable, compassionate and non-violent just for the sake of a supposed positive end result the right way to go about it. Being virtuous should be for the sake of it. These values are self-sufficient. Any decent individual (I define a decent individual as someone who is not a narcissistic psychopath and doesn’t cause voluntary harm to other beings) would, to some extent, subscribe to these values. I consider myself a decent person, in that I try my best to imbibe these values into my own life. But I don’t need the concept of God to enforce these values into my life; I do it because it elevates the ability of me being able to live with myself. It helps me sleep better at night, knowing that my life has a net positive effect on others.\r\n\r\nIn the same vein, not doing ‘bad’ or morally dubious actions just because you fear an ultimate punishment is in itself morally dubious. What I hear in that statement is that you would do those immoral things, like lying, stealing, harming others etc., if no one was watching. But morality should be independent of the outcome of your actions. An immoral action is, well, immoral even if no one is watching to hold you accountable for it. I personally mostly refrain from doing actions that I consider immoral because they would affect the previously mentioned ability to live with myself and to go to sleep peacefully at night; I will be held accountable for them at the highest court in existence: my conscience. \r\n\r\nYou may say, no action is without motivation. In that case, the only acceptable motivation for being moral is to achieve inner peace: that aforementioned ability to live with yourself.\r\n\r\n## Most conceptions of God are dumb\r\n\r\nIn most versions of God, He (generally a ‘He’) is narcissistic, needy and immature. Basically a person who’s just hit puberty. Most things God tells us, usually go something like.\r\n\r\n- If you don’t believe in me, you’re suffering for eternity.\r\n- If you believe in other Gods, you’re suffering for eternity.\r\n- If you don’t prostrate before me and worship me regularly… you get the point\r\n\r\nSo basically we’ve got Donald Trump from The Apprentice. But instead of saying ‘you’re fired’. He’s sending you towards eternal damnation.\r\n\r\nYou would assume that a being that literally created the entire universe with a single utterance would be more secure with themselves so as to not need a bunch of ephemeral, dumb apes to acknowledge their presence. But no, God needs us to submit to him and he needs us to sing praises of him.\r\n\r\nIt’s often said, God created us in his image. But it’s perhaps the other way around. We created God in our image. That’s why He looks like a human in our imagination and behaves just like a human. I am reminded of that family guy bit where a man about to be bitten by a snake says, “If Jesus exists, I will not die”. But then the snake says, “If snake Jesus exists, he will die”. Then, a nearby tree says, “If tree Jesus exists, both of them will die”. Then a flash of lightning snaps a the tree in half and kills the man and the snake and the tree says, “Thank you tree Jesus”. We’re so utterly lacking in our imagination that our God looks just like us. Hinduism is better, in that we have gods of all shapes, sizes and species. \r\n\r\n## ‘God did it’ is garbage answer to the fundamental question\r\n\r\nHumans are curious creatures. It is our ability to ask questions and pursue their answers that allowed us to unravel the very nature of the universe. But at some point in time, we inevitably hit a roadblock. The fundamental Question: Why is there something rather than nothing? Why does anything exist? Even better: How does anything exist? This is something that we haven’t been able to answer, at least with the scientific method. Perhaps, we will never be able to answer it. This leaves a gaping void in our understanding of the universe and it causes us to answer it with, what I consider is an intellectually garbage answer: ‘God did it’. There is something rather than nothing because God wished that there be something rather than nothing. For one, it’s non-falsifiable. We cannot prove that claim otherwise. Also, the natural next question would be, “Why and how does God exist?” to which people respond in two ways. You have the initial ‘God has always existed’ and if you insist on further questioning, your head separated from your torso, usually by means of a sharp object.\r\n\r\nWhy not be intellectually honest and say, “We don’t know.” It’s not as comforting as the other answer, I know. But as exurb1a said, it’s better to have questions we can’t answer than answers we can’t question.\r\n\r\n## In conclusion\r\n\r\nI have very little knowledge of science, and barely any of religion. This essay is not meant to convert you into an atheist nor is it any meaningful critique of religion. This is my attempt to question notions that go unquestioned, mostly for myself. I don’t know if God exists or not. All I’m saying is, the answer to that question does not matter to me. Agnosticism is often associated with sitting on the fence, being in neither camp fully: be it the religious one or the atheistic one. But both positions are two sides of the same coin; Atheists and Religious people both center their beliefs around one idea: God. The latter believe in the validity of it and the former negate it; Both doing it with equal passion. What I’m doing is defenestrating that idea altogether. I’m proposing that we live as if God doesn’t exist. I’m proposing that we become masters of our own morality; That we become less fearful of ideas that loom the threat of divine punishment over our heads for thinking critically about those ideas; That we become comfortable with not having answers to every question we pose and yet don’t ever give up striving to find those answers. Finally, I hope that in this striving we find meaning, both for ourselves and all of humanity.",
    "thumbnail": "/images/godless.jpg\r"
  },
  {
    "id": 1668882600,
    "title": "Probabilistic Existentialism\r",
    "author": "Aneesh Bhat\r",
    "date": "November 20, 2022",
    "time": "00:00",
    "content": "## How Your Life is a Miracle\r\nHave you ever looked up at the stars on a summer night and thought about the vastness of the universe? Me neither. Part of the reason is that you can’t see any stars these days. I used to think it was because of the clouds and the pollution. While that is still partly the case, it’s mainly because of a different kind of pollution: light pollution. \r\n\r\nSee, we spend so much time exposed to bright lights - in our homes, on city streets, and in restaurants - that we become desensitized to the fainter light that comes from distant stars, which are farther away from us more than any other source of light we see. That’s why if you go out tonight and look up in the sky, chances are, you will only see the moon, planets like Jupiter and Saturn, and a few of the brightest stars embedded on a sheet of darkness and not the starry sky we often imagine. \r\n\r\nBut back to the topic on hand, the vastness of the universe. I have stayed awake at night thinking about it. \r\n\r\nLet’s go on a journey together, shall we?\r\n\r\nWe live on Earth. There are eight planets in our solar system that revolve around the Sun, of which the Earth is one. Our Sun is a star, just like all the other stars you see in the sky. Take many of these stars together, and I mean A LOT, and you get a galaxy. Our galaxy is known as the Milky Way, and there are said to be about 100-400 billion stars in our galaxy. This is all first-grade astronomy. \r\n\r\nBut our galaxy is not the only one around…\r\n![Image from James Webb](/images/james-webb.jpg)\r\n\r\nTake a look at this picture. It was taken by the James Webb Space Telescope (JWST), a $10 billion undertaking by NASA, ESA, and the Canadian Space Agency. It’s probably the most advanced space telescope ever created. Each one of the bright spots in this picture is a galaxy, not a star. That’s right, There are more than a hundred of these spots, each of which is a galaxy, with as many or more stars as ours, and each of those stars with its own planets.\r\nAs unimaginably big as it looks, what we see through our eyes at night or take pictures of with instruments like the JWST, is just a small part of the entire universe.\r\n\r\nThe universe began about 13.72 billion years ago, and since then, galaxies, nebulae, black holes, and all sorts of crazy things have happened. The stars that you see at night are very, very far away. According to Einstein’s Special Theory of Relativity, nothing can travel through space faster than light. What is the speed of light? About three hundred thousand meters per second. That makes the speed of light the ultimate speed limit in the universe. That means that not even light can travel faster than that through space. \r\n\r\nBecause stars are so far away from us, sometimes it takes light itself millions of years to reach us from those stars. The Sun is pretty far away from the Earth. That’s why it takes eight minutes for the light from the Sun to reach us. The closest star to our solar system is Proxima Centauri. I say closest, but it takes 4 years for light to reach us from that star. And it’s the same with all stars. Depending on how far they are from us, light could take a few thousand or a few million years to reach us once it’s emitted by those stars. So when you look at stars in the sky, you’re looking at them as they were millions of years ago. In all likelihood, those stars could have died by now. Essentially, you aren’t looking at a live broadcast of the universe; rather, it’s like you are just getting your mail sent millions of years ago. \r\n\r\nNow that we know that (i) the universe is about 14 billion years old, and (ii) light travels at a finite speed, we can move on to understand why we see only part of the entire universe. This region of the cosmos that we can see is termed the ‘observable universe.’ You could imagine the observable region as a sphere, with its center located at the Earth. Anything outside the boundary of this sphere is a total mystery to us. Why is this? It’s because the universe is expanding, and it has been doing so since its genesis, and it’s well accepted that it might be doing so faster than light. But how? Didn’t I say that light is the ultimate speed limit? Well, if you go back and read carefully, I wrote nothing can travel through space faster than light. That means nothing can travel within space faster than light. Think of it as you swimming in the ocean. The water provides some resistance to your movement and will slow you down. But if you’re riding a wave, you move pretty fast. What this leads to is the universe keeps expanding while light moves with a constant speed from across the universe. As a result, we only can see the light that has traveled for nearly 14 billion years since that’s how long the universe has been around. Also, since the objects that gave off that light 14 billion years ago have also moved further away from us, we estimate the observable universe to be about 93 billion light years from one end to the other. (Light year is a measure of distance, not time. It’s basically the distance light travels in space in one Earth-year, which is about 9.461 x 1015 meters). \r\n\r\nThe observable universe has about 100 billion galaxies, each probably containing 100 billion stars. What we have is a number that is too large to even mention, but I will anyway. It’s 1024. That’s 1, followed by 24 zeros. Think of how many planets could be orbiting these stars. \r\n\r\nSince we learned about the extent of the cosmos, a question that’s been asked is, ‘Does life exist anywhere apart from the Earth.’ Some people will give you a hard “No,” while others will show you video evidence of UFO sightings here on Earth. The aptest answer, in my opinion, is “We don’t know.” The current scientific evidence suggests that we are alone; We haven’t found signs of life despite looking hard. But before you think we’re special by any means, we inhabit an average-sized rocky planet that goes around an average-sized star that lies in one of the spiral arms of an average-sized galaxy. There are larger ‘Earth-like’ planets than ours; some planets have two suns. Some have red stars. Some planets orbit around stars that, in turn, orbit around black holes. The largest known star, UY Scuti, is about 1700 times larger than our Sun. If you took a picture of the Milky Way from the outside without our solar system in it, you probably wouldn’t even be able to tell the difference. There might, in all probability, be other Earth-like planets that might harbor carbon-based life, or it’s also possible that there are totally different types of life that do not require the conditions we do to survive. We don’t know what we don’t know.\r\n\r\nIf you paid attention, you might have noticed that we’re pretty small on a cosmic scale where distances span millions of light years. But we don’t have to travel a million light-years to realize how small we are. Look at the picture Voyager 1 took of the Earth just as it was about to leave the Solar System. This picture was taken at the request of Carl Sagan, a renowned astrophysicist. Sagan’s quote about this picture of ‘The pale blue dot’ has stuck with me:\r\n\r\n![Pale Blue Dot](/images/palebluedot.jpg)\r\n\r\n> “Look again at that dot. That's here. That's home. That's us. On it everyone you love, everyone you know, everyone you ever heard of, every human being who ever was, lived out their lives. The aggregate of our joy and suffering, thousands of confident religions, ideologies, and economic doctrines, every hunter and forager, every hero and coward, every creator and destroyer of civilization, every king and peasant, every young couple in love, every mother and father, hopeful child, inventor and explorer, every teacher of morals, every corrupt politician, every \"superstar,\" every \"supreme leader,\" every saint and sinner in the history of our species lived there - on a mote of dust suspended in a sunbeam.”\r\n\r\nThe universe operates on timescales far longer than anything we’re used to. The universe is believed to have begun 13.72 billion years ago. The temperatures were too high at that time for matter to exist as it does now. It cooled down eventually and hydrogen and helium gasses were formed. For a while these were the only things around before they collapsed on each other to form a star. Soon many stars began to show up and galaxies were formed. The milky way was formed 13.6 billion years ago. Our home star, the Sun, was formed relatively recently, 4.6 billion years ago. With the star came the planets orbiting it. The Earth is said to have formed 4.5 billion years ago. Then it took a long time for it to cool down, for liquid water to appear and landmasses to form. Life appeared on Earth  only 3.7 billion years ago. Cyanobacteria or blue-green algae might be the first organisms to ever evolve on earth.  Dinosaurs first appeared about 200 million years ago and went extinct about 65 million years ago. The Homo Sapiens: Us,  appeared about two hundred thousand years ago.  Since then we’ve risen to the top of the food chain, invented language, given rise to civilization, created tools, made art and in effect conquered the planet. One of our biggest achievements was on July 20, 1969, when Neil Armstrong and Buzz Aldrin set foot on the surface of the moon. We hopefully have a long way to go still.\r\n\r\nLooking to the future. In  ten thousand years from now, the red supergiant star Antares will have likely exploded in a supernova, which would be visible from earth in daylight. In about 600 million years, the moon would have moved far enough away from the Earth that Solar Eclipses will no longer occur. The nearest galaxy to ours is Andromeda. It’s about 2.53 million light years away from the Milky Way. But, in about 4 billion years, the Milky Way and Andromeda will collide to form a new galaxy Milkomeda. In about 7.5 billion years, the Sun will have become so big it will engulf the Earth. But all life on Earth would have died by then. In 3x1043  years, it’s possible that all nucleons (protons and neutrons) would have decayed or disintegrated and the only remaining objects in the universe will be black holes, beginning the ‘Black Hole Era.’\r\n\r\nFar into the future our universe may undergo a ‘heat death,’ which means it will reach a state of thermodynamic equilibrium. See, heat (a form of energy) tends to flow from regions of higher temperature (like stars) to regions of lower temperatures, and when heat flows, machines like engines, plants, and human bodies can do work. But when the universe is in a state of thermodynamic equilibrium, the temperature everywhere would be the same; hence, there would be no useful energy left to do work. After the heat death, nothing will ever happen. No new stars, no new galaxies, no new life, no music, no expressions of love, no essays written by kids trying to be existential.\r\n\r\nNow, if you’re an average human, you’ll probably live to be about 60-70 years of age, give or take. If you consider all that I said before, you won’t be able to help but notice that our lives are very short (I should have used more “very”s, but you get the point).\r\n\r\nI once heard an interesting idea. Consciousness (a by-product of this human existence) is a rate-limiter of your sense-perception of time. What that means is that it’s your brain and the fact that you’re conscious that allows you to experience time at the rate you currently do. It’s as if the events that happened right from the Big Bang up to the moment of your birth, from your perspective, happened instantaneously. And in the same vein, after you die, from your perspective, all the events that follow will also happen instantaneously. Only when you’re alive, do you perceive time passing at the rate you currently do. Your consciousness is what allows you to experience reality like you do now.\r\n\r\nBut that’s not forever. You probably are aware that you exist right now, and you were aware yesterday, a year ago, and ten years ago. But you had no awareness of anything before you were born. And similarly, you’ll probably not be aware of anything after you die. That is, if there is no afterlife, as most religions claim.\r\n\r\nThis, to me, paints a rather dark image of our place in this universe, about what our lives mean in the grand scheme of things. About how much the trials and tribulations of life really matter. About what our hopes, dreams, and aspirations all mean. About what our relationship with other people and with nature is. If we are so small in the seemingly infinite universe, and we’re so insignificant in the history of the universe, what is the point of anything? The ultimate fate of everything is decay and the final state of the universe is one of maximum entropy. Does that mean Morty Smith from Rick and Morty was right in saying that “Nothing means anything, and we’re all gonna die”? Probably.\r\n\r\nBut, then again…\r\n\r\nFor all the cosmic dread, there are also cosmic miracles. No, I don’t mean supernatural miracles performed by gods or with magic. I mean probabilistic miracles.\r\n\r\nYou measure the probability of an event by dividing the number of favorable outcomes of an experiment by the total number of possible outcomes. Say you perform an experiment like flipping a coin. You want to get heads; that makes it a favorable outcome. The total number of possible outcomes is two, i.e., you can get heads or tails. So the probability of you getting heads turns out to be one-in-two, i.e., 50%. Keep in mind that probability doesn’t predict the occurrence of an event, it only tells you what the chances of that event happening are.\r\n\r\nSo, how does probability work in this experiment called the universe? There are seemingly infinite possible outcomes that could have occurred since the Big Bang. How is it that the most favorable outcomes for us all happened perfectly? The formation of the Sun and  the formation of the Earth. The fact that the Earth is at just the right distance (The Goldilocks zone of the sun) for liquid water and by extension life to exist. The evolution of cyanobacteria which fed on primordial soup.  The formation of the ozone layer which helped life to exist on land. The extinction of dinosaurs which probably allowed mammals to evolve. The evolution of Homo sapiens. Us inventing language and using it to conquer the world. There are too many of these events for them to seem like coincidences.\r\n\r\nBut these events are like flipping a coin. We only measure the probability of the results of our experiment. But there are also rules that underlie a coin toss. There’s gravity, air resistance, the velocity with which you project the coin upwards, the amount of spin you give it, the weight of the coin, etc. Hypothetically, if you could measure all these conditions accurately and have a powerful enough computer, you could predict the result of the coin toss while it’s mid-air. The thing to note here is there are predefined parameters or rules that allow you to perform this experiment. It is because of those parameters that the coin sometimes shows heads and sometimes shows tails. We have similar rules that govern our universe.\r\n\r\nSince its beginning, these fundamental rules underlie every interaction in our universe. We currently know of four fundamental forces in nature. They are the gravitational force, the electromagnetic force, the strong nuclear force, and the weak nuclear force. All natural phenomena can be explained as a consequence of these forces. Gravitational force is what causes two bodies with mass to be attracted to each other. The electromagnetic force governs the interaction between charged particles, and the strong nuclear force is responsible for keeping protons and neutrons bound together in the nucleus and is also responsible for keeping quarks (particles that make up protons and neutrons) bound together. The weak nuclear force underlies some forms of radioactivity, governs the decay of unstable subatomic particles such as mesons, and initiates the nuclear fusion reaction that fuels the Sun.\r\n\r\nAll of the fundamental forces depend on certain physical parameters like mass or electric charge but would have a constant ‘strength’ throughout the universe if those parameters were kept constant. For example, the gravitational force depends on two parameters: the mass of the two bodies that attract each other and the distance between them. Now, if you keep those two parameters constant, i.e., If you fix the masses of the two bodies and the distance between them to be the same, the ‘strength’ of the gravitational attraction between them will remain the same anywhere in the universe. This is because the gravitational force comes with a constant that is the same throughout the universe, aptly named the universal gravitational constant (G). What it tells us is that if two bodies had a fixed mass of, say, 1 kg, and were a fixed distance apart, say, 1 meter, they would attract each other with a force that is constant at all times and all places ( in this case, 6.67 x 10-19 Newtons). Now, if that constant force were any stronger, everything would have collapsed on itself. Conversely, if it were any weaker, there would have been no stars because the gravitational force was not strong enough for gasses in the early universe to come closer to each other to form a star. That would mean there would be no planets and no life. Just hydrogen and helium gasses floating around in an empty expanse. Physics is full of such constants that are so fundamental to the universe, that if they were any different, the universe would look vastly different.\r\n\r\nBut these miracles are not just at the cosmic level. Even just looking at your ancestry, every single ancestor of yours must have been at the right place at the right time for you to be alive today. Think about it, if your great-great-great grandparents had never met or had met a day later or earlier, you might not have been here. And that’s true for all your ancestors.\r\n\r\nThis would all suggest that there’s some intelligent design, some method to the madness, some pre-written book where all these events are mentioned. But as our knowledge currently stands, there is none. These random events are just that, random. There are a few rules according to which the universe works, and everything else is just a consequence of those rules. The rules themselves are also arbitrary; they’re not fine-tuned so that life could exist. So that you could exist. They could have been different, and it wouldn’t have mattered. You being alive today is pure chance.\r\n\r\nThis is the thought that haunts me when I lie awake in bed at 2:00 am. I don’t know what to think of this, though. Is it terrifying? Does it suggest that our lives are meaningless on a cosmic level? I don’t know. Maybe it is; perhaps they are.\r\n\r\nIt’s rather hard to acknowledge that our lives are entirely arbitrary. We have an inherent need to look for patterns and for meaning. Maybe that’s why a lot of people attribute the fact that there is something, rather than nothing, to God. That’s the question that’s underneath every question. Why does anything exist? I don’t know the answer to that, and it’s unlikely anyone truly does.\r\n\r\nBut I also get an odd sense of comfort thinking about this. It’s hard for me to put it into words.\r\n\r\nThe Dictionary of Obscure Sorrows is a website that describes itself as “...a dictionary of made-up words for emotions that we all feel but don’t have the words to express…” In it is the word ‘Sonder.’\r\n\r\nsonder\r\nn. the realization that each random passerby is living a life as vivid and complex as your own—populated with their own ambitions, friends, routines, worries and inherited craziness—an epic story that continues invisibly around you like an anthill sprawling deep underground, with elaborate passageways to thousands of other lives that you’ll never know existed, in which you might appear only once, as an extra sipping coffee in the background, as a blur of traffic passing on the highway, as a lighted window at dusk.\r\nIt’s the feeling you get in a concert or a stadium (or anywhere with lots of people), and you’re surrounded by thousands of people, and you suddenly realize that every single person has a life of their own. That every single one of them was once a child and now has grown into the person they are. That every one of them will go home today or go to work tomorrow and deal with their own struggles. That there will be moments where they will experience unparalleled joy because of the most trivial things, and in other moments might experience crushing grief because of a great loss. That you, despite how it might seem to you, are not alone in experiencing what it means to be human; you’ve got more than 8 billion people quietly doing it alongside you. \r\n\r\nI wonder if there’s any word for realizing that every person you come across during the day has a life as arbitrary as yours. What if there was anything different in history? They would probably not be sitting at the table next to yours in the cafe or walking in front of you on the sidewalk. The atoms that make up our body were formed when stars exploded billions of years ago. The atoms that are currently you probably were someone else at some point and will be someone else in the future. But right now, you, whoever you are, however you look or speak, whatever your name is, are the sum total of all the things that randomly happened a certain way since the beginning of the universe. I don’t know about you, but that makes me feel like nothing less than a miracle. And I think you are too. That’s probably not that helpful when you have to deal with life tomorrow and for the rest of your years. But I hope you do remember, in some corner of your mind, that existence, though terrifying, hard, painful, and often unbearable at times, is a miraculous phenomenon.  \r\n\r\nThere is also a case to be made for the view that the fact that our existence is arbitrary holds little significance. Yes, our lives are improbable, but we’re here! Look at it from a different perspective; it seems like our existence, and by extension, the universe’s existence in its current state, is inevitable.\r\n\r\nThough for me, this fact suggests that Meaning is a profoundly personal thing. Meaning is a jumper you have to knit for yourself. The universe didn’t come with a manual for how my life should be lived. I am, like all others, winging it. The foremost responsibility one has is towards oneself. And that fact also informs us of our responsibility towards our fellow humans and the only home we know: the Earth. As it stands now, we’re all we’ve got. \r\n\r\nRemember that picture of the pale blue dot and the quote by Carl Sagan? There’s more to it:\r\n\r\n> …The Earth is a very small stage in a vast cosmic arena. Think of the rivers of blood spilled by all those generals and emperors so that, in glory and triumph, they could become the momentary masters of a fraction of a dot. Think of the endless cruelties visited by the inhabitants of one corner of this pixel on the scarcely distinguishable inhabitants of some other corner, how frequent their misunderstandings, how eager they are to kill one another, how fervent their hatreds.</br>\r\nOur posturings, our imagined self-importance, the delusion that we have some privileged position in the Universe, are challenged by this point of pale light. Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves.</br>\r\nThe Earth is the only world known so far to harbor life. There is nowhere else, at least in the near future, to which our species could migrate. Visit, yes. Settle, not yet. Like it or not, for the moment the Earth is where we make our stand.</br>\r\nIt has been said that astronomy is a humbling and character-building experience. There is perhaps no better demonstration of the folly of human conceits than this distant image of our tiny world. To me, it underscores our responsibility to deal more kindly with one another, and to preserve and cherish the pale blue dot, the only home we've ever known.\r\n\r\n\r\n",
    "thumbnail": "/images/probability.jpg\r"
  }
]