[
  {
    "id": 1698148740,
    "title": "The Martian",
    "author": "Aneesh R. Bhat\r",
    "date": "October 24, 2023",
    "time": "17:29",
    "content": "It’s a hot afternoon in the summer of 2016. I’m visiting my village with my family. Everyone’s lazing around, with not much else to do. I see that my uncle has an interesting new device I’d never seen before. It was a Kindle, the electronic reader. By that time (I was probably eleven or twelve years old), I had been taken by the magical voodoo devices known to man as books. I loved reading. I asked my uncle for the kindle and began fiddling with it, figuring out how everything works. I came across some obscure sci-fi titles that my uncle read (and some of which I would also read in a few years), and then came across a title that seemed familiar: The Martian. The cool movie I’d seen about the astronaut getting stuck on Mars had a book? I had to check it out.\r\n\r\nAnd before I knew it, the book had taken me. For a young me, it was unfamiliar territory. In retrospect, the book was way too mature for a kid my age. It was the first time I encountered profanity in a book. Very creative profanity, might I add, which amused me a lot at the time (and still does today). It had vocabulary that was way too advanced for me (Thank God for the built-in dictionaries on Kindles). Certain paragraphs flew right over my head. I must have read and reread certain sections repeatedly just to understand what they meant. And it became clear why that was the case, after I reread it again recently. The book belongs to the hard sci-fi genre. It is a subgenre of science fiction that emphasises on scientific accuracy and logic (And I didn’t even know that the mitochondria are the powerhouse of the cell, back then).\r\n\r\nFinally, I don’t know how many days later, I finished the damn book. And what an experience that was. Having watched the movie previously helped me a lot, because I was able to anchor the events in the book to the events in the movie. But I still remember my experience with the book being much more profound than my experience with the movie. \r\n\r\nA good marker for how good a piece of content is probably its revisitability. How much would you be willing to invest your time in it again and again? I would go on to read the book and watch the movie several times later, as I grew older. It was fun each time. Seeing Mark Watney struggle against the hostile planet, in a bid to get back home after he was left behind by his crew, presumed to be dead. The Martian, if you consider that metric, might just be one of the best pieces of fiction I’ve ever consumed.\r\n\r\nThat goes for the movie too. I recently rewatched the movie, some five or six years later, and it still had the magic. It’s a mix of nostalgia and the fact that the movie is just that good. Everything from the casting, to the music. The visuals, the pacing, and the cinematography all tie in to make a timeless movie. \r\n\r\n## The Casting\r\n\r\nThe casting in this movie is perfect. Every actor fits the character they’re playing. Even when reading the book, in my mind, Jessica Chastain is Commander Lewis and Matt Damon is Mark Watney. I could never picture their characters as anyone else. Jeff Daniels provides the authoritative command required for the character of the NASA Director, Teddy Sanders. Sean Bean, provides justice to the defiant Mitch Henderson, who just wants to do right by the Ares III crew. Kristen Wiig also shines as the ever PR-conscious Annie Montrose. Even Donald Glover who has a small role, playing Rich Purnell does a great job as comedic relief. The casting works. No one seems out of place.\r\n\r\nAnd of course, we have to talk about the main character - Mark Watney. Watney can be described best using the Hindi slang ‘*Bakchod*’. Google translates the word to 'nonsense'. But in more common use cases, it's used to describe a person who can find humor in an adverse situation. A person who weathers storms with a laugh. Who doesn’t take shit more seriously than they’re required to. Mark Watney is that guy (As mentioned even in the book, during a TV interview scene with psychologists who worked with the astronauts). Watney, in the book, was chosen for the Ares III mission mainly due to his ability to keep the fabric of the team together. \r\n\r\nMatt Damon becomes Mark Watney. He, in a way, carries the movie through its running minutes. The ‘Earth’ scenes are accompaniments to Watney’s situation on Mars. A lot of dialogues in the book and the movie is Mark talking to the camera, while recording a log on the Hab or in the Rover. To do that, and still keep the audience interested is no mean feat and Damon does it spectacularly.\r\n\r\n## The Music\r\n\r\nComposer Henry Gregson-Williams provides an eerie, atmospheric score that portrays Mark Watney’s solitude. Unlike Hans Zimmer’s brass and string-heavy tracks in the Christopher Nolan movies, particularly Interstellar (another movie where Matt Damon appears), the Martian’s soundtrack is somber and light, and yet carries emotional weight. As Mark drives through the Martian terrain from his home base- Acidalia Planitia to the Ares IV base at Schiaparelli crater, an emotional score plays in the background, reminiscent of the toll this ordeal has taken on not only the stranded astronaut, but also everyone back home working tirelessly to bring him back. \r\n\r\nBut the light-heartedness and energy ever present in the movie is accentuated not with a background score, but with timeless pieces of music from a bygone era. A running gag in the movie and the book is Mark shitting on Commander Lewis’ disco music collection. Unfortunately, that is probably the only music he has available. Imagine being stuck on Mars with ABBA’s *Waterloo*, or Donna Summer’s *Hot Stuff*.\r\n\r\nThe more uplifting pieces in the movie’s soundtrack play during the most hopeful moments of the movie. Particularly, David Bowie’s *Starman*, which plays during a montage of the Taiyang Shen being prepared for a resupply mission to the Hermes while Mark modifies the rover for his long journey ahead, with instruction by the smart folk back home. It’s truly magical, enough to make you shed a tear. Not in the least because the song is amazing, but also because of the significance of the scene. The crew breaks the news to their families, that they’re potentially going to be spending an additional 500 days in space, with their lives at constant jeopardy. Yet, they laugh and they express their love for each other. Because, as the lyric from the song goes,\r\n\r\n> He’s told us not to blow it, ‘cause he knows it’s all worthwhile.  \r\n\r\nTwo nations, although working together to, in part, serve their own self-interests, but working together nonetheless to preserve the spirit of space exploration. \r\nAnd in the very end, as if to surmise the entire movie, Gloria Gaynor’s I will survive plays, as the credits roll. The song itself is about heartbreak and abandonment by a loved one, but in Mark Watney’s case it describes his will, with which he did survive on the unforgiving planet and returned home safely.\r\n\r\n## Cinematography and Visuals\r\n\r\nThe Martian has one of the best visual effects out of recent space movies. And it makes sense. Much of the movie features said visual effects. \r\nA large chunk of the Mars scenes is based in the Hab- Watney’s home for the time he’s stranded on Mars, or at least with the Hab in the background. The white-canvas-walled habitat is airy and spacious. With good reason too. Remember, it was supposed to house six astronauts for about a month. Laden with terminals and screens, tables placed in the center with various apparatus on them, the first time we really see the Hab (when an injured Mark enters it and provides himself with medical attention), it immediately throws in the midst of an exoplanetary habitat that was haphazardly abandoned by its dwellers. \r\n\r\nThe Rover, MAV, and the Hermes all look spectacular. As a person who loves the book, these elements as shown in the movie is what I imagine when reading the book too. The Hermes looks like the International Space Station, if it had more lengthwise growth and took steroids. Again, this is a craft that is supposed to be used by six people over a span of 3 years, on and off. Also, it’s what facilitates all the Ares missions. It has to look like it can do the job, and they have made it so. It’s hard to describe a spaceship, or any sort of vehicle that is not already embodied in the collective consciousness of the audience. Andy Weir did a good job of describing the functionality of each of these vehicles. But Ridley Scott and Co. really brought these to life. \r\n\r\nThere can be made a case that good movie adaptations are supposed to do just that: bring the words to life. That might seem obvious, but we can recount several instances of a good book ruined in the adaptation simply because it was not faithful, not just to the story, but also to the world of the book: its rules, its characters, and its soul. The Martian, is a good adaptation because it does bring the world, the characters and the underlying tension and levity of the plot to life. \r\n\r\nIn the book, most of the 'Mark scenes' are written from a first-person perspective. Mark is logging his activities into a log, and by that medium he talks with the reader. The movie naturally could not recreate that without weirding the audience out too much (Imagine if all Watney scenes were him monologuing into the camera). But they integrate that aspect of the story with the regular third-person shots quite well. Whenever Watney’s talking, he’s usually talking to the video log, either in the Hab or the Rover. But we also see him spreading soil, treating his shit to make fertilizer, lugging stuff around, digging, drilling, driving and a host of other activities he has to do to survive. \r\n\r\nDuring the course of the movie, the makers established another important character. Mars itself. The angry red planet that is intent on fucking up Mark’s efforts to get home. The loneliness of being the only person on a planet that is hostile to your kind. The long shots of the Martian terrain as Mark drives the rover through it. The tall mountains ever present in the background of the Hab. The storm that caused the Ares III mission to get scrubbed, and which nearly killed Mark and left him stranded on the planet. The planet’s low gravity (which the makers actually portrayed by altering Damon’s movements). All these things and more cascade to establish the Red Planet as a character in its own right. Silent, but ever-present. Arid, desolate, and hostile, Mars, in the wrong circumstances, is an astronaut’s worst enemy.\r\n\r\n<hr>\r\n\r\nThat is all about the movie, for now. I’ll be doing a deep dive into the story itself in the next post where I’ll simultaneously be analyzing the book. We’ll look at what the book does that the movie chose to leave out, what I think about certain creative decisions, and why the book remains one of my favorite pieces of fiction, all these years later.",
    "thumbnail": "/images/themartian.jpg\r"
  },
  {
    "id": 1684409040,
    "title": "Stop giving so much of a fuck.\r",
    "author": "Aneesh R. Bhat\r",
    "date": "May 18, 2023",
    "time": "16:54",
    "content": "## An attempt at copywriting\r\n\r\nDo you feel like you care about random bullshit too much? Do you take others’ opinions too seriously? Do you forget that we live on a floating space rock that goes around a ball of burning gas which is itself floating through a vast expanse of nothingness? Do you also forget that you are going to die one day?\r\n\r\nIf your answer to all of these was yes, then I’ve got just the right thing for you. It’s called *not giving so much of a fuck* and it has potential to change your life.\r\n\r\nUsers who have tried it report feeling like a heavy load being lifted from their back. They also suffer reduced amounts of cognitive dissonance and report increased levels of overall happiness. *Not giving so much of a fuck* has allowed them to get after what they really want without feeling guilty about it. \r\n\r\n*Not giving so much of a fuck* helps you find your personal style, do the things you actually like, make better decisions in life, helps you date the people who are compatible with you, makes your friendships better, and makes you a much cooler person in general (But that won’t even matter, because who gives a fuck about being cool). As an added bonus, you also get free self esteem.\r\n\r\n*Not giving so much of a fuck* helps you recognize that people are confused chumps like you who, for the most part, don’t know what they’re talking about. You’ll learn to give people the place that they deserve and not obsess about trying to prove something to someone or win someone’s approval.\r\n\r\nYou’ll stop being scared of sticking out. *Not giving so much of a fuck* has proven to be an excellent remedy for being a super-conformist. \r\n\r\n*Not giving so much of a fuck* is extremely easy to use. Although it takes a bit of determination and a firm will to start, users can start as easily as deciding not to give so much of a fuck. \r\n\r\nTry *not giving so much of a fuck* today. \r\n\r\nWe’ve also got a special offer for you, for a limited time all humans can try not giving so much of a fuck for zero cost.. \r\n\r\nThis offer ends the day you die. Hurry, before it’s too late.",
    "thumbnail": "/images/pablo-heimplatz-eavs-4kngrk-unsplash.jpg\r"
  },
  {
    "id": 1684325520,
    "title": "I Do Not Fear Death\r",
    "author": "Aneesh R. Bhat\r",
    "date": "May 17, 2023",
    "time": "17:42",
    "content": "Sure, if you put a gun to my head, I’d probably be scared. But I don’t fear the concept of death: An eternity’s worth of nothingness. It actually seems quite favorable, to be honest.\r\n\r\nI’ve not read Camus, but I do know that one of his most famous lines are about about [suicide being the only serious philosophical problem](https://bigthink.com/personal-growth/the-meaning-of-life-albert-camus-on-faith-suicide-and-absurdity/). ‘Why live?’ seems to be what he’s asking. I find myself in total agreement with him.\r\n\r\nSome months ago, I came up with a poem that although not very good poetically, summarizes my thoughts nicely:\r\n\r\n> Being alive is brilliant,\r\n>\r\n> But death wouldn’t be so bad either.\r\n>\r\n> Teetering on the edge of is and not,\r\n>\r\n> My fragile self wishes for the next moment.\r\n>\r\n> Don’t leave me hanging\r\n>\r\n> In that intolerable eternity\r\n>\r\n> You call a single second.\r\n>\r\n> It’s too hard,\r\n>\r\n> The abyss too deep\r\n>\r\n> For me to climb out of.\r\n>\r\n> Let my share of being run dry and\r\n>\r\n> Let me stop being.\r\n>\r\n> But, while that happens:\r\n>\r\n> While I die a little every moment,\r\n>\r\n> And until the moment I’ve finished dying,\r\n>\r\n> Let me be happy,\r\n>\r\n> Let me love,\r\n> And let me be.\r\n\r\nThese days I’ve been doing a lot of new things. I built a blog and I started writing again. I’ve begun exercising and meditating and reading a lot. And I have a lot of things that I have yet to do. But I can confidently say that I can die tomorrow and I won’t have any regrets (Confidence of a guy who’s sitting comfortably in his room and has never had any kind of threat to his life, mind you). That might be too existential, or maybe I’m depressed or something else, but it feels right to me. That’s why these days I’ve been focusing on things that give me joy. The possibility of death looms over all of us at every moment of our lives. As David Goggins, in his [epic birthday message](https://www.reddit.com/r/davidgoggins/comments/paxcjn/david_goggins_birthday_message_for_joe_from_joe/) to Joe Rogan, said: “When taking that first breath (on the day you were born), it made you eligible to die.”\r\n\r\nI think the way to live life in light of this fact is to minimize the possibility of regret. In the twenty four hours you get in a day, assuming you survive all of them, live the way YOU want to live. And of course you can introspect on whether the way you want to live is the best way to live, but that has to be a personal journey. Do not be bogged down by what others tell you. This also pertains to my previous post ‘[Do Not Sell Your Soul](https://aneeshrbhat.netlify.app/post/1684300680)’.\r\n\r\nI’m generally indifferent to a lot of things. I have a few people and things I care about. I can count on my fingers the things I want from my life and even if I don’t get them, that’s okay. This might be something that requires more elaboration and a deeper understanding on my part, and I’ll probably explore it in a future essay. But for now, that’s all I have to say.",
    "thumbnail": "/images/ahmed-adly-1ptm6b85sdw-unsplash.jpg\r"
  },
  {
    "id": 1684280940,
    "title": "If you're drowning, make a lot of noise",
    "author": "Aneesh R. Bhat",
    "date": "May 17, 2023",
    "time": "05:19",
    "content": "I recently got into a sticky situation where a large amount of money got stuck in processing and that caused me a lot of stress and anger. While I did make sure to tell myself that in these situations, where you don’t have any control over the turn of events, the only thing you can do is stand your ground and keep calm, I also learnt the importance of seeking help.\r\n\r\nAs the title suggests, if you’re in a sticky situation where it seems like you can’t do much, i) Stay calm. Everything will turn out the way it needs to, which is to say we can’t do jackshit as to how history ultimately unfolds; and ii) Do everything you can to fix the situation. That involves seeking help.\r\n\r\nHow my situation eventually got solved was a few people, who I approached, pulling some strings to solve my problem. They were complete strangers and yet they stuck their necks out for me. I don’t know why they did that, but it’s, for me personally, a testament to human kindness that still exists, despite what we see on the internet.\r\n\r\nSo that’s it. If you find yourself drowning, make a lot of noise. Eventually a kind person will stop to help you.\n",
    "thumbnail": "/images/matt-collamer-8ug90aypdw4-unsplash.jpg"
  },
  {
    "id": 1684086000,
    "title": "What do we owe our parents?\r",
    "author": "Aneesh R. Bhat\r",
    "date": "May 14, 2023",
    "time": "23:10",
    "content": "## Nothing. Atleast, nothing by default  \r\n\r\nWhy are we born on this planet? It's not because we wanted it. We were too non-existent to want anything. We were born because two people decided that they wanted us to be born. And they didn't have any noble reason to do so either. They were either fulfilling their biological imperative or societal expectations, or they were having relationship troubles and thought you would fix that, or they were just bored and wanted something to engage them for twenty-odd years. We have no say in any of that, but we nonetheless are thrust into existence and here we are.\r\n\r\nThat being said, we can make the case that giving birth to a human being is a purely personal choice that people make. It’s a decision and with that, come certain responsibilities. One has to feed their child and give them an education and keep them from dying and all in all, ensure that the child grows to become a functioning adult.\r\n\r\nFor many, raising a child can be immensely fulfilling. We have heard stories of how people's lives immediately changed when they held their child for the first time. I think that’s a wonderful phenomenon and I agree that parenting is a lot of hard work and we ought to respect good parents when we see them.\r\n\r\nBut what I think a lot of people forget is that children are not investment opportunities. Parents, Indian ones especially and I’m sure all around the world, expect their children to act as if they owe them something. To choose the career they want them to, to marry the person they want them to and to take care of them in their old age. \r\n\r\nHowever, I don't believe that children, simply by virtue of being their parents' children, automatically owe them anything. Sure, you can *choose* to owe them something. But ‘choose’ is the keyword here. It’s a choice. Just like the choice to bring you into existence was your parents' choice, the decision to follow their advice and do what they tell you should be a choice. Furthermore whatever they did for you after you were born were not 'sacrifices'. They were duties that they agreed to take on the moment they decided to have you. Where is the sacrifice in having to do exactly what you wanted to? How many children make actual sacrifices just to appease their parents because the idea that they owe their parents something has been drilled into them since childhood?\r\n\r\nAnd I'm not saying that we must not be empathetic to our parents' struggles and not be grateful to them. If you think they deserve that, then by all means be grateful. But we should also not be overly emotional when our parents come into question. We must remove this idea that we somehow owe our parents something just because we are their children.\r\n\r\nHow many people choose a career path they don't want simply because they feel obligated to please their parents? How many people end up marrying the wrong person just because their parents left them with no other option. How many adults still live under the emotional tyranny of their parents, with their vision shrouded by the belief that they owe their parents to not disobey them? Maybe we should let go of that idea and start seeing our parents as fallible human beings who can be just as wrong as you can and that although you love them, you don't, in an existential sense, owe them anything.",
    "thumbnail": "/images/abba.jpg\r"
  },
  {
    "id": 1684001400,
    "title": "Writing your way from Chaos to Order\r",
    "author": "Aneesh R. Bhat\r",
    "date": "May 13, 2023",
    "time": "23:40",
    "content": "I was journaling this morning and came up with something that I instantly knew was going into my notes.       \r\n\r\n> I have only my experience of reality to account for. A writer’s job is to bridge the gap between the experiencer and the experienced. It brings the reader close to a whole domain of reality hitherto restricted to them, due to the fact that your experience of reality resides solely within your mind.\r\n\r\nIt's often said that reality is stranger than fiction. That's true. Reality is not bound by the limitations of human imagination, out of which fiction is born. There might as well be some kind of celestial entity, some kind of alien race, some piece of technology in some distant corner of the universe, that the most ingenuitive sci-fi writers can't come up with. Because they, even in the mastery of their craft, are bound by the same limits that you and I are. The limit of finite experience. The farthest things we can ever know about are within the observable universe, and the deepest we can go into the stuff that makes up matter is at the level of the Quarks and Leptons. Anything  we can know, and as a result imagine about (even in ways that can never be real) are bound by these limitations. But reality is not. Sure, the laws of physics bind reality, but do we know all the laws that govern the universe? No. So there must be something in reality that is yet to seem stranger to us than fiction. \r\nBut fiction plays an important function. It brings us closer to reality, in the sense that it allows us to fathom what possibilities reality might allow to become real. Many inventions today were thought of by veterans of sci-fi years before they were even deemed a possibility. Hoverboards, tablets, digital billboards, and what seems like the big daddy of all technology today,  Artificial Intelligence.\r\n\r\nWe have to be able to imagine something for us to even begin working to make it real. Fiction does that for us. That's why I love sci-fi. It's us coming to terms with our future reality so that when it does finally arrive, we might not be as weirded out by it, or frightened of it as we might be otherwise (Because as you know, humans tend to fear what they don't understand). What happens in the hearts of black holes? What happens to us when we sleep. What even is consciousness? These things might have weird answers, but because we would have already dwelled into their possible weirdness through fiction, it will be a tad bit easier for us to digest them.\r\n\r\nI have another question. Just as the painter has her canvas and the sculptor has his block of stone, what is that for the writer? What is the writer's canvas? You might say it's the blank page, or the blank document. But the writer’s canvas is really the first draft.\r\n\r\nIt’s said that the constraints are the canvas. But the blank page is a domain of infinite possibility. Anything can happen within that blank sheet of paper. You might say that the writer is limited by how much she can write on the page. But  unlike the dimensions of the canvas or a block of stone, the length of the page  isn't really a limitation for the writer. A written work can span tens of thousands of pages or multiple volumes. The vocabulary of a language is also not a limitation, because writers can create their own words, just like how Douglas Adams created words like flollop and vollue to describe the activities of talking mattresses. Language itself isn't a limitation, because like J.R.R Tolkien, writers can create their own languages too. And readers will gobble that shit up if the quality of writing is good enough and even go as far as learning the fictional language.\r\n\r\nThere are only two real limitations posed to a writer. One, the number of characters/alphabets in any particular language she's writing in, along with the numerals, accented characters, or any other quirks of that system. These are finite, but when they are strung together to form words and subsequently sentences, paragraphs and entire works, the possibilities are endless. Sure, maybe certain letters can only work with certain other letters to form words and there are certain semantic and syntactic rules to a language, but the possibilities are still not far from endless. But a writer can't make up new characters and associated sounds unless everyone understands them and agrees to use them.  \r\n\r\nThe second limitation is the medium of the written word itself. There's a finite number of ways you can describe a person shooting another person in written form. That's the limitation that this medium provides a writer with. But the definition of who a writer is blurry today. A screenwriter is as much a writer as a writer for a video game who is as much a writer as a mangaka. They all use the features and limitations of their chosen medium to tell their story. But the medium nonetheless, has limitations. \r\n\r\nBut despite these, when the writer sits in front of the blank page or document, there's still a near-infinite amount of things that can end up being written on that page. And we know that infinite anything is bad. If you have an infinite amount of money, for example,  you'll crash the fucking economy, of course. But the personal value you attach to anything money could buy goes down drastically for you. Infinity is a quick path to nihilism.\r\n\r\nWhat the writer literally does is bring order from the seeming chaos of the blank page and creates something tangible, rule-bound and meaningful. Then the real process of writing begins. Then you have something to work with. The rules and the boundaries of whatever it is that is written are defined. They can be stretched, restricted further, or even broken. But at least they're not non-existent. \r\n\r\nThe first draft is akin to a slab of stone. The writer chisels away the excess, defines what is undefined, and in some cases even adds more meat where it’s required. She tames infinity and then makes it look pretty. In doing that, the writer moves from chaos to order, both in her mind and on the page and brings us, as a civilization, closer to reality.",
    "thumbnail": "/images/chaos.jpg\r"
  }
]